# Table of Contents 

- **[Series](#Series)**
- **[DataFrame](#DataFrame)**
    - [Accessing a DataFrame](#Accessing-a-DataFrame)
    - [Boolean Indexing](#Boolean-Indexing)
    - [Adding columns and rows](#Adding-columns-and-rows)
    - [Deleting columns and rows](#Deleting-columns-and-rows)
    - [Reading and Writing DataFrames](#Reading-and-Writing-DataFrames)
    - [Missing Data](#Missing-data)
- **[DataFrame Operations](#DataFrame-Operations)**
    - [Matrix operations](#Matrix-operations)
    - [Column operations](#Column-operations)

- **[Data Splitting](#Data-Splitting)**
    - [Grouping](#Grouping)    

- **[Matplotlib: plotting examples](#Matplotlib:-plotting-examples)**
    - [Plotting with pandas](#Plotting-with-pandas)

### The Data Mining Process 

Image from: 

    Usama M. Fayyad, Gregory Piatetsky-Shapiro, Padhraic Smyth, and Ramasamy Uthurusamy. 
    Advances in Knowledge Discovery and Data Mining. MIT Press, Menlo Park, CA, 1996

![datamining](images/DataMiningProcess.PNG)

**Pandas** is desgined to make **data pre-processing and data analysis fast and easy in Python**. Pandas adopts many coding idioms from NumPy, such as avoiding the `for` loops, but it is designed for working with heterogenous data represented in tabular format.

To use Pandas, you need to import the `pandas` module, using for example:

In [1]:
import pandas as pd
import numpy as np # we will also need numpy

This import style is quite standard; all objects and functions the `pandas` package will now be invoked with the `pd.` prefix.

## Aside: Numpy
NumPy (**Num**erical **Py**thon) is the fundamental package for scientific computing with Python. It contains, among other things:

- a powerful N-dimensional array object
- sophisticated functions that support broadcasting (i.e. it allows to perform arithmetic operations between arrays with different shape)
- tools for integrating C/C++ and Fortran code
- useful linear algebra, Fourier transform, and random number capabilities

The core object of numpy is **ndarray**: N-dimensional Array. It represents a multidimensional, homogeneous array of fixed-size items.

In [2]:
# example of 1-dimensional array
np.arange(0, 1, 0.1)

array([0. , 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9])

In [3]:
# example of 2-dimensional array
my_ndarray = np.zeros((3,5))
my_ndarray

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [4]:
np.asarray([1,2,3])

array([1, 2, 3])

In [5]:
type(np.asarray([1,2,3]))

numpy.ndarray

In [6]:
print(my_ndarray)
print(my_ndarray.shape)
print(my_ndarray.ndim)
print(my_ndarray.size)
print(my_ndarray.dtype)

[[0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]]
(3, 5)
2
15
float64

There are several NumPy functions for [creating arrays](https://docs.scipy.org/doc/numpy/user/quickstart.html#array-creation):

| Function | Description |
| ---: | :--- |
| `np.array(a)` | Create $n$-dimensional NumPy array from sequence `a` |
| `np.linspace(a,b,N)` | Create 1D NumPy array with `N` equally spaced values from `a` to `b` (inclusively)|
| `np.arange(a,b,step)` | Create 1D NumPy array with values from `a` to `b` (exclusively) incremented by `step`|
| `np.zeros(N)` | Create 1D NumPy array of zeros of length $N$ |
| `np.zeros((n,m))` | Create 2D NumPy array of zeros with $n$ rows and $m$ columns |
| `np.ones(N)` | Create 1D NumPy array of ones of length $N$ |
| `np.ones((n,m))` | Create 2D NumPy array of ones with $n$ rows and $m$ columns |
| `np.eye(N)` | Create 2D NumPy array with $N$ rows and $N$ columns with ones on the diagonal (ie. the identity matrix of size $N$) |

### Mathematical Functions

[Mathematical functions](http://docs.scipy.org/doc/numpy/reference/routines.math.html) in NumPy are called [**universal functions**](https://docs.scipy.org/doc/numpy/user/quickstart.html#universal-functions) and are *vectorized*. Vectorized functions operate *element-wise* on arrays producing arrays as output and are built to compute values across arrays *very* quickly.

The following table contains a list of the most important unary ufuncs.

|Function| Description |
|:-------|:---------|
|`np.abs`|Compute the absolute value element-wise for integer, floating-point, or complex values|
|`np.sqrt`|Compute the square root of each element|
|`np.exp`|Compute the exponent $e^x$ of each element|
|`np.log`, `np.log10`, `np.log2`, `np.log1p`|Natural logarithm (base e), log base 10, log base 2, and log(1 + x), respectively|
|`np.sign`|Compute the sign of each element: 1 (positive), 0 (zero), or –1 (negative)|
|`np.ceil`|Compute the ceiling of each element|
|`np.floor`|Compute the floor of each element|
|`np.modf`|Return fractional and integral parts of array as a separate array|
|`np.isnan`|Return boolean array indicating whether each value is `NaN` (Not a Number)|
|`np.cos`, `np.cosh`, `np.sin`, `np.sinh`, `np.tan`, `np.tanh`|Regular and hyperbolic trigonometric functions|
|`np.arccos`, `np.arccosh`, `np.arcsin`, `np.arcsinh`, `np.arctan`, `np.arctanh`|Inverse trigonometric functions|

The following table contains a list of the most important binary ufuncs.

|Function| Description |
|:-------|:---------|
|`np.add`|Element-wise addition|
|`np.subtract`|Element-wise subtraction|
|`np.multiply`|Element-wise multiplication|
|`np.divide`|Element-wise division|
|`np.mod`|Element-wise modulus|
|`np.power`|Raise elements in first array to powers indicated in second array |
|`np.maximum`, `np.fmax`|Element-wise maximum; `np.fmax` ignores `NaN`|
|`np.minimum`, `np.fmin`|Element-wise minimum; `np.fmin` ignores `NaN`|


Pandas has two main data structures, **Series** and **DataFrame**.

# Series

Series are the Pandas version of 1-D Numpy arrays. 

An instance of Series is a single dimension array-like object containing:
- a *sequence of values*,
- an array of *data labels*, namely its **index**.

A Series can be created easily from a Python list:

In [7]:
ts = pd.Series([4, 8, 1, 3])
print(ts)

0    4
1    8
2    1
3    3
dtype: int64

The string representation of a Series display two columns: the first column represents the index array, the second column represents the values array. Since no index was specified, the default indexing consists of increasing integers starting from 0.

The underlying structure can be recovered with the `values` attribute:

In [8]:
print(ts.values)
print(type(ts.values))

[4 8 1 3]
<class 'numpy.ndarray'>

To create a Series with its own index, you can write:

In [9]:
ts = pd.Series([4, 8, 1, 3], index=['first', 'second', 'third', 'fourth'])
print(ts)

first     4
second    8
third     1
fourth    3
dtype: int64

The labels in the index can be used to select values in the Series:

In [10]:
print(ts['first'])

4

In [11]:
print(ts[['second', 'fourth']])

second    8
fourth    3
dtype: int64

You can think about a Series as a kind of fixed-length, ordered Python's `dict`, mapping index values to data values. In fact, it is possible to create a Series directlty from a Python's `dict`:

In [12]:
my_dict = {'Pisa': 80, 'London': 300, 'Paris': 1}
ts = pd.Series(my_dict)
print(ts)

Pisa       80
London    300
Paris       1
dtype: int64

Sorting a series:

- sort by values

In [13]:
ts.sort_values()

Paris       1
Pisa       80
London    300
dtype: int64

- sort by index

In [14]:
ts.sort_index()

London    300
Paris       1
Pisa       80
dtype: int64

In [15]:
ts

Pisa       80
London    300
Paris       1
dtype: int64

In [16]:
ts.sort_values?

Signature:
ts.sort_values(
    *,
    axis: 'Axis' = 0,
    ascending: 'bool | Sequence[bool]' = True,
    inplace: 'bool' = False,
    kind: 'SortKind' = 'quicksort',
    na_position: 'NaPosition' = 'last',
    ignore_index: 'bool' = False,
    key: 'ValueKeyFunc | None' = None,
) -> 'Series | None'
Docstring:
Sort by the values.

Sort a Series in ascending or descending order by some
criterion.

Parameters
----------
axis : {0 or 'index'}
    Unused. Parameter needed for compatibility with DataFrame.
ascending : bool or list of bools, default True
    If True, sort values in ascending order, otherwise descending.
inplace : bool, default False
    If True, perform operation in-place.
kind : {'quicksort', 'mergesort', 'heapsort', 'stable'}, default 'quicksort'
    Choice of sorting algorithm. See also :func:`numpy.sort` for more
    information. 'mergesort' and 'stable' are the only stable  algorithms.
na_position : {'first' or 'last'}, default 'last'
    Argument 'first' puts NaNs at the beginning, 'last' puts NaNs at
    the end.
ignore_index : bool, default False
    If True, the resulting axis will be labeled 0, 1, …, n - 1.
key : callable, optional
    If not None, apply the key function to the series values
    before sorting. This is similar to the `key` argument in the
    builtin :meth:`sorted` function, with the notable difference that
    this `key` function should be *vectorized*. It should expect a
    ``Series`` and return an array-like.

Returns
-------
Series or None
    Series ordered by values or None if ``inplace=True``.

See Also
--------
Series.sort_index : Sort by the Series indices.
DataFrame.sort_values : Sort DataFrame by the values along either axis.
DataFrame.sort_index : Sort DataFrame by indices.

Examples
--------
>>> s = pd.Series([np.nan, 1, 3, 10, 5])
>>> s
0     NaN
1     1.0
2     3.0
3     10.0
4     5.0
dtype: float64

Sort values ascending order (default behaviour)

>>> s.sort_values(ascending=True)
1     1.0
2     3.0
4     5.0
3    10.0
0     NaN
dtype: float64

Sort values descending order

>>> s.sort_values(ascending=False)
3    10.0
4     5.0
2     3.0
1     1.0
0     NaN
dtype: float64

Sort values putting NAs first

>>> s.sort_values(na_position='first')
0     NaN
1     1.0
2     3.0
4     5.0
3    10.0
dtype: float64

Sort a series of strings

>>> s = pd.Series(['z', 'b', 'd', 'a', 'c'])
>>> s
0    z
1    b
2    d
3    a
4    c
dtype: object

>>> s.sort_values()
3    a
1    b
4    c
2    d
0    z
dtype: object

Sort using a key function. Your `key` function will be
given the ``Series`` of values and should return an array-like.

>>> s = pd.Series(['a', 'B', 'c', 'D', 'e'])
>>> s.sort_values()
1    B
3    D
0    a
2    c
4    e
dtype: object
>>> s.sort_values(key=lambda x: x.str.lower())
0    a
1    B
2    c
3    D
4    e
dtype: object

NumPy ufuncs work well here. For example, we can
sort by the ``sin`` of the value

>>> s = pd.Series([-4, -2, 0, 2, 4])
>>> s.sort_values(key=np.sin)
1   -2
4    4
2    0
0   -4
3    2
dtype: int64

More complicated user-defined functions can be used,
as long as they expect a Series and return an array-like

>>> s.sort_values(key=lambda x: (np.tan(x.cumsum())))
0   -4
3    2
4    4
1   -2
2    0
dtype: int64
File:      ~/opt/anaconda3/envs/DMML2023/lib/python3.11/site-packages/pandas/core/series.py
Type:      method

Note: **no pandas method has the side effect of modifying your data; almost every method returns a new object, leaving the original object untouched. If the data is modified, it is because you did so explicitly.**

**Arithmetic operations** on Series are automatically aligned on the index labels:

In [17]:
ts1 = pd.Series([4, 8, 1, 3], index=['first', 'second', 'third', 'fourth'])
ts2 = pd.Series([4, 8, 1], index=['first', 'second', 'pisa'])

In [18]:
ts1

first     4
second    8
third     1
fourth    3
dtype: int64

In [19]:
ts2

first     4
second    8
pisa      1
dtype: int64

In [20]:
ts_sum = ts1 + ts2
print(ts_sum)

first      8.0
fourth     NaN
pisa       NaN
second    16.0
third      NaN
dtype: float64

Here two index values are correctly computed (corresponding to the label `first` and `second`). The two other index labels `third` and `fourth` in `ts1` are missing in `ts2`, as well as the `pisa` index label in `ts2`. Hence, for each of these index label, a `NaN` value (*not a number*) appears, which Pandas considers as a **missing value**.

The `pd.isnull` (or `pd.isna`) and `pd.notnull` (or `pd.notna`) functions detects missing data. There are also corresponding **instance methods**.

In [21]:
pd.isnull(ts_sum)

first     False
fourth     True
pisa       True
second    False
third      True
dtype: bool

In [22]:
ts_sum.isnull()

first     False
fourth     True
pisa       True
second    False
third      True
dtype: bool

In [23]:
pd.notnull(ts_sum)

first      True
fourth    False
pisa      False
second     True
third     False
dtype: bool

In [24]:
ts_sum.notnull()

first      True
fourth    False
pisa      False
second     True
third     False
dtype: bool

# DataFrame

A DataFrame is a **rectangular table of data**. It contains an ordered list of columns. Every column can be of a different type. 

A DataFrame has both a *row index* and a *column index*. It can be thought as a *dictionary of Series* (one per column) all sharing the same index labels.

There are many ways to construct a DataFrame: one of the most common is using a dictionary of Python's lists (or NumPy's arrays):

In [25]:
cars = {'Brand': ['Honda Civic', 'Toyota Corolla', 'Ford Focus', 'Audi A4'],
        'Price': [22000, 25000, 27000, 35000],
        'Wheels': 4} # broadcast if possible

df = pd.DataFrame(cars)
print(df)

            Brand  Price  Wheels
0     Honda Civic  22000       4
1  Toyota Corolla  25000       4
2      Ford Focus  27000       4
3         Audi A4  35000       4

The resulting DataFrame will receive its index automatically as with Series.

To pretty-print a DataFrame in a Jupyter notebooks, it is enough to write its name (or using the `head()` instance method for very long DataFrames):

In [26]:
display(df)

            Brand  Price  Wheels
0     Honda Civic  22000       4
1  Toyota Corolla  25000       4
2      Ford Focus  27000       4
3         Audi A4  35000       4

In [27]:
df

            Brand  Price  Wheels
0     Honda Civic  22000       4
1  Toyota Corolla  25000       4
2      Ford Focus  27000       4
3         Audi A4  35000       4

Access the T attribute, to transpose a dataframe

In [28]:
df.T

                  0               1           2        3
Brand   Honda Civic  Toyota Corolla  Ford Focus  Audi A4
Price         22000           25000       27000    35000
Wheels            4               4           4        4

In [29]:
df.head(2)

            Brand  Price  Wheels
0     Honda Civic  22000       4
1  Toyota Corolla  25000       4

In [30]:
df.tail(2)

        Brand  Price  Wheels
2  Ford Focus  27000       4
3     Audi A4  35000       4

A summary of the *numerical* data is provided by `describe`:

In [31]:
df.describe()

              Price  Wheels
count      4.000000     4.0
mean   27250.000000     4.0
std     5560.275773     0.0
min    22000.000000     4.0
25%    24250.000000     4.0
50%    26000.000000     4.0
75%    29000.000000     4.0
max    35000.000000     4.0

In [32]:
df.describe(include = 'object')

              Brand
count             4
unique            4
top     Honda Civic
freq              1

In [33]:
df.describe(include = 'all')

              Brand         Price  Wheels
count             4      4.000000     4.0
unique            4           NaN     NaN
top     Honda Civic           NaN     NaN
freq              1           NaN     NaN
mean            NaN  27250.000000     4.0
std             NaN   5560.275773     0.0
min             NaN  22000.000000     4.0
25%             NaN  24250.000000     4.0
50%             NaN  26000.000000     4.0
75%             NaN  29000.000000     4.0
max             NaN  35000.000000     4.0

If working with a large table, it might be useful to sometimes have a list of all the columns' names. This is given by the `keys()` methods:

In [34]:
print(df.keys())

Index(['Brand', 'Price', 'Wheels'], dtype='object')

In [35]:
print(df.columns)

Index(['Brand', 'Price', 'Wheels'], dtype='object')

Many feature from the NumPy package can be directly used with Pandas DataFrames

In [36]:
print(df.values)
print()
print(type(df.values))

[['Honda Civic' 22000 4]
 ['Toyota Corolla' 25000 4]
 ['Ford Focus' 27000 4]
 ['Audi A4' 35000 4]]

<class 'numpy.ndarray'>

In [37]:
print(df.shape)

(4, 3)

Another common way to create a DataFrame is to use a *nested dict of dicts*:

In [38]:
population = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

If this nested dict is passed to the DataFrame, the **outer dict keys are interpreted as column labels**, and the **inner keys are interpreted as row labels**:

In [39]:
df = pd.DataFrame(population)
df

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

Sorting a dataframe:

In [40]:
df.sort_values(by = 'Ohio',ascending = False) # by can be a string or list of strings

      Nevada  Ohio
2002     2.9   3.6
2001     2.4   1.7
2000     NaN   1.5

## Accessing a DataFrame

Let's create a brand new DataFrame:

In [41]:
dict_of_list = {'birth': [1860, 1770, 1858, 1906], 
                'death':[1911, 1827, 1924, 1975], 
                'city':['Kaliste', 'Bonn', 'Lucques', 'Saint-Petersburg']}
composers_df = pd.DataFrame(dict_of_list, index=['Mahler', 'Beethoven', 'Puccini', 'Shostakovich'])
composers_df

              birth  death              city
Mahler         1860   1911           Kaliste
Beethoven      1770   1827              Bonn
Puccini        1858   1924           Lucques
Shostakovich   1906   1975  Saint-Petersburg

There are multiple ways of accessing values or series of values in a Dataframe. Unlike in Series, a simple bracket gives access to a column and not an index, for example:

In [42]:
composers_df['city']

Mahler                   Kaliste
Beethoven                   Bonn
Puccini                  Lucques
Shostakovich    Saint-Petersburg
Name: city, dtype: object

returns a Series. Alternatively one can also use the attributes syntax and access columns by using:

In [43]:
composers_df.city

Mahler                   Kaliste
Beethoven                   Bonn
Puccini                  Lucques
Shostakovich    Saint-Petersburg
Name: city, dtype: object

The attributes syntax has some limitations, so in case something does not work as expected, revert to the brackets notation.

When specifiying multiple columns, a DataFrame is returned:

In [44]:
composers_df[['city', 'birth']]

                          city  birth
Mahler                 Kaliste   1860
Beethoven                 Bonn   1770
Puccini                Lucques   1858
Shostakovich  Saint-Petersburg   1906

Standard indexing operators (just slices the rows)

In [45]:
composers_df[0:2]

           birth  death     city
Mahler      1860   1911  Kaliste
Beethoven   1770   1827     Bonn

from the [docs](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html):
>The Python and NumPy indexing operators [$\cdot$] and attribute operator  `.` provide quick and easy access to pandas data structures across a wide range of use cases. This makes interactive work intuitive, as there’s little new to learn if you already know how to deal with Python dictionaries and NumPy arrays. However, since the type of the data to be accessed isn’t known in advance, directly using standard operators has some optimization limits. For production code, we recommended that you take advantage of the **optimized pandas data access methods**.

Pandas optimized data access methods:  `iloc` and `loc`.

**Remember that `loc` and `iloc` are attributes, not methods, hence they use brackets `[]` and not parenthesis `()`.**

The `loc` attribute allows to recover elements by using the index labels, while the `iloc` attribute can be used to recover the regular indexing:

In [46]:
composers_df.iloc[0:2,:]

           birth  death     city
Mahler      1860   1911  Kaliste
Beethoven   1770   1827     Bonn

In [47]:
composers_df.loc[['Mahler','Beethoven'], 'death']

Mahler       1911
Beethoven    1827
Name: death, dtype: int64

In [48]:
composers_df.loc['Beethoven', 'death']

1827

## Boolean Indexing

Just like with Numpy, it is possible to subselect parts of a Dataframe using boolean indexing.
A logical Series can be used as an index to select elements in the Dataframe.

In [49]:
composers_df

              birth  death              city
Mahler         1860   1911           Kaliste
Beethoven      1770   1827              Bonn
Puccini        1858   1924           Lucques
Shostakovich   1906   1975  Saint-Petersburg

In [50]:
mask = composers_df['death'] > 1859
print(mask)
composers_df[mask]

Mahler           True
Beethoven       False
Puccini          True
Shostakovich     True
Name: death, dtype: bool

              birth  death              city
Mahler         1860   1911           Kaliste
Puccini        1858   1924           Lucques
Shostakovich   1906   1975  Saint-Petersburg

More compact:

In [51]:
composers_df[composers_df['birth'] > 1900]

              birth  death              city
Shostakovich   1906   1975  Saint-Petersburg

To sum up: basics of indexing
| Operation | Syntax | Result |
| :---: | :---: | :---: |
| Select column | `df[col]` (or `df.col`, where possible) | Series |
| Select row by label | `df.loc[label]` | Series |
| Select row by integer location | `df.iloc[loc]` | Series |
| Slice rows | `df[5:10]` | DataFrame |
| Select rows by boolean vector | `df[bool_vect]` | DataFrame |

## Adding columns and rows

It is very simple to add a column to a Dataframe:

In [52]:
composers_df['country'] = '???'
composers_df

              birth  death              city country
Mahler         1860   1911           Kaliste     ???
Beethoven      1770   1827              Bonn     ???
Puccini        1858   1924           Lucques     ???
Shostakovich   1906   1975  Saint-Petersburg     ???

Alternatively, an existing list can be used:

In [53]:
composers_df['country2'] = ['Austria','Germany','Italy','Russia']
composers_df

              birth  death              city country country2
Mahler         1860   1911           Kaliste     ???  Austria
Beethoven      1770   1827              Bonn     ???  Germany
Puccini        1858   1924           Lucques     ???    Italy
Shostakovich   1906   1975  Saint-Petersburg     ???   Russia

A DataFrame or a Series can be "appended" to another DataFrame through `pd.concat`

In [54]:
new_row = pd.DataFrame({'Sibelius':{'birth':None,'death':1900, 'city': None, 'country':None}}).T
new_row

          birth  city  country   death
Sibelius    NaN   NaN      NaN  1900.0

In [55]:
pd.concat((composers_df,new_row))

               birth   death              city country country2
Mahler        1860.0  1911.0           Kaliste     ???  Austria
Beethoven     1770.0  1827.0              Bonn     ???  Germany
Puccini       1858.0  1924.0           Lucques     ???    Italy
Shostakovich  1906.0  1975.0  Saint-Petersburg     ???   Russia
Sibelius         NaN  1900.0               NaN     NaN      NaN

More on [Database-style DataFrame or named Series joining/merging](https://pandas.pydata.org/docs/user_guide/merging.html#database-style-dataframe-or-named-series-joining-merging)

## Deleting columns and rows

In [56]:
composers_df

              birth  death              city country country2
Mahler         1860   1911           Kaliste     ???  Austria
Beethoven      1770   1827              Bonn     ???  Germany
Puccini        1858   1924           Lucques     ???    Italy
Shostakovich   1906   1975  Saint-Petersburg     ???   Russia

In [57]:
composers_df.drop(columns = ['country2'])

              birth  death              city country
Mahler         1860   1911           Kaliste     ???
Beethoven      1770   1827              Bonn     ???
Puccini        1858   1924           Lucques     ???
Shostakovich   1906   1975  Saint-Petersburg     ???

In [58]:
tmp_df = composers_df.drop('Puccini')
tmp_df

              birth  death              city country country2
Mahler         1860   1911           Kaliste     ???  Austria
Beethoven      1770   1827              Bonn     ???  Germany
Shostakovich   1906   1975  Saint-Petersburg     ???   Russia

In [59]:
composers_df #note that, by default, drop does not operate in-place

              birth  death              city country country2
Mahler         1860   1911           Kaliste     ???  Austria
Beethoven      1770   1827              Bonn     ???  Germany
Puccini        1858   1924           Lucques     ???    Italy
Shostakovich   1906   1975  Saint-Petersburg     ???   Russia

In [60]:
composers_df.drop?

Signature:
composers_df.drop(
    labels: 'IndexLabel | None' = None,
    *,
    axis: 'Axis' = 0,
    index: 'IndexLabel | None' = None,
    columns: 'IndexLabel | None' = None,
    level: 'Level | None' = None,
    inplace: 'bool' = False,
    errors: 'IgnoreRaise' = 'raise',
) -> 'DataFrame | None'
Docstring:
Drop specified labels from rows or columns.

Remove rows or columns by specifying label names and corresponding
axis, or by directly specifying index or column names. When using a
multi-index, labels on different levels can be removed by specifying
the level. See the :ref:`user guide <advanced.shown_levels>`
for more information about the now unused levels.

Parameters
----------
labels : single label or list-like
    Index or column labels to drop. A tuple will be used as a single
    label and not treated as a list-like.
axis : {0 or 'index', 1 or 'columns'}, default 0
    Whether to drop labels from the index (0 or 'index') or
    columns (1 or 'columns').
index : single label or list-like
    Alternative to specifying axis (``labels, axis=0``
    is equivalent to ``index=labels``).
columns : single label or list-like
    Alternative to specifying axis (``labels, axis=1``
    is equivalent to ``columns=labels``).
level : int or level name, optional
    For MultiIndex, level from which the labels will be removed.
inplace : bool, default False
    If False, return a copy. Otherwise, do operation
    in place and return None.
errors : {'ignore', 'raise'}, default 'raise'
    If 'ignore', suppress error and only existing labels are
    dropped.

Returns
-------
DataFrame or None
    Returns DataFrame or None DataFrame with the specified
    index or column labels removed or None if inplace=True.

Raises
------
KeyError
    If any of the labels is not found in the selected axis.

See Also
--------
DataFrame.loc : Label-location based indexer for selection by label.
DataFrame.dropna : Return DataFrame with labels on given axis omitted
    where (all or any) data are missing.
DataFrame.drop_duplicates : Return DataFrame with duplicate rows
    removed, optionally only considering certain columns.
Series.drop : Return Series with specified index labels removed.

Examples
--------
>>> df = pd.DataFrame(np.arange(12).reshape(3, 4),
...                   columns=['A', 'B', 'C', 'D'])
>>> df
   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

Drop columns

>>> df.drop(['B', 'C'], axis=1)
   A   D
0  0   3
1  4   7
2  8  11

>>> df.drop(columns=['B', 'C'])
   A   D
0  0   3
1  4   7
2  8  11

Drop a row by index

>>> df.drop([0, 1])
   A  B   C   D
2  8  9  10  11

Drop columns and/or rows of MultiIndex DataFrame

>>> midx = pd.MultiIndex(levels=[['llama', 'cow', 'falcon'],
...                              ['speed', 'weight', 'length']],
...                      codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
...                             [0, 1, 2, 0, 1, 2, 0, 1, 2]])
>>> df = pd.DataFrame(index=midx, columns=['big', 'small'],
...                   data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
...                         [250, 150], [1.5, 0.8], [320, 250],
...                         [1, 0.8], [0.3, 0.2]])
>>> df
                big     small
llama   speed   45.0    30.0
        weight  200.0   100.0
        length  1.5     1.0
cow     speed   30.0    20.0
        weight  250.0   150.0
        length  1.5     0.8
falcon  speed   320.0   250.0
        weight  1.0     0.8
        length  0.3     0.2

Drop a specific index combination from the MultiIndex
DataFrame, i.e., drop the combination ``'falcon'`` and
``'weight'``, which deletes only the corresponding row

>>> df.drop(index=('falcon', 'weight'))
                big     small
llama   speed   45.0    30.0
        weight  200.0   100.0
        length  1.5     1.0
cow     speed   30.0    20.0
        weight  250.0   150.0
        length  1.5     0.8
falcon  speed   320.0   250.0
        length  0.3     0.2

>>> df.drop(index='cow', columns='small')
                big
llama   speed   45.0
        weight  200.0
        length  1.5
falcon  speed   320.0
        weight  1.0
        length  0.3

>>> df.drop(index='length', level=1)
                big     small
llama   speed   45.0    30.0
        weight  200.0   100.0
cow     speed   30.0    20.0
        weight  250.0   150.0
falcon  speed   320.0   250.0
        weight  1.0     0.8
File:      ~/opt/anaconda3/envs/DMML2023/lib/python3.11/site-packages/pandas/core/frame.py
Type:      method

## Reading and Writing DataFrames

A common way of "creating" a Pandas Dataframe is by importing a table from another format like CSV (comma separated values) or Excel.

### CSV format

In [61]:
df

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [62]:
df.to_csv('out/foo.csv')

In [63]:
df_read = pd.read_csv('out/foo.csv')
df_read

   Unnamed: 0  Nevada  Ohio
0        2001     2.4   1.7
1        2002     2.9   3.6
2        2000     NaN   1.5

In [64]:
df_read = pd.read_csv('out/foo.csv',index_col = 0)
df_read

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

### Importing Excel files

An Excel table is provided in the [composers.xlsx](data/composers.xlsx) file and can be read with the `pd.read_excel` function.

You may need to install `openpyxl` package through `pip install openpyxl`

In [65]:
#!pip install openpyxl

In [66]:
composers_df = pd.read_excel('dataset/composers.xlsx')
composers_df

       composer  birth  death              city
0        Mahler   1860   1911           Kaliste
1     Beethoven   1770   1827              Bonn
2       Puccini   1858   1924           Lucques
3  Shostakovich   1906   1975  Saint-Petersburg

The reader automatically recognized the heaers of the file. However it created a new index. If needed we can specify which column to use as header:

In [67]:
pd.read_excel?

Signature:
pd.read_excel(
    io,
    sheet_name: 'str | int | list[IntStrT] | None' = 0,
    *,
    header: 'int | Sequence[int] | None' = 0,
    names: 'list[str] | None' = None,
    index_col: 'int | Sequence[int] | None' = None,
    usecols: 'int | str | Sequence[int] | Sequence[str] | Callable[[str], bool] | None' = None,
    dtype: 'DtypeArg | None' = None,
    engine: "Literal['xlrd', 'openpyxl', 'odf', 'pyxlsb'] | None" = None,
    converters: 'dict[str, Callable] | dict[int, Callable] | None' = None,
    true_values: 'Iterable[Hashable] | None' = None,
    false_values: 'Iterable[Hashable] | None' = None,
    skiprows: 'Sequence[int] | int | Callable[[int], object] | None' = None,
    nrows: 'int | None' = None,
    na_values=None,
    keep_default_na: 'bool' = True,
    na_filter: 'bool' = True,
    verbose: 'bool' = False,
    parse_dates: 'list | dict | bool' = False,
    date_parser: 'Callable | lib.NoDefault' = <no_default>,
    date_format: 'dict[Hashable, str] | str | None' = None,
    thousands: 'str | None' = None,
    decimal: 'str' = '.',
    comment: 'str | None' = None,
    skipfooter: 'int' = 0,
    storage_options: 'StorageOptions | None' = None,
    dtype_backend: 'DtypeBackend | lib.NoDefault' = <no_default>,
    engine_kwargs: 'dict | None' = None,
) -> 'DataFrame | dict[IntStrT, DataFrame]'
Docstring:
Read an Excel file into a pandas DataFrame.

Supports `xls`, `xlsx`, `xlsm`, `xlsb`, `odf`, `ods` and `odt` file extensions
read from a local filesystem or URL. Supports an option to read
a single sheet or a list of sheets.

Parameters
----------
io : str, bytes, ExcelFile, xlrd.Book, path object, or file-like object
    Any valid string path is acceptable. The string could be a URL. Valid
    URL schemes include http, ftp, s3, and file. For file URLs, a host is
    expected. A local file could be: ``file://localhost/path/to/table.xlsx``.

    If you want to pass in a path object, pandas accepts any ``os.PathLike``.

    By file-like object, we refer to objects with a ``read()`` method,
    such as a file handle (e.g. via builtin ``open`` function)
    or ``StringIO``.

    .. deprecated:: 2.1.0
        Passing byte strings is deprecated. To read from a
        byte string, wrap it in a ``BytesIO`` object.
sheet_name : str, int, list, or None, default 0
    Strings are used for sheet names. Integers are used in zero-indexed
    sheet positions (chart sheets do not count as a sheet position).
    Lists of strings/integers are used to request multiple sheets.
    Specify None to get all worksheets.

    Available cases:

    * Defaults to ``0``: 1st sheet as a `DataFrame`
    * ``1``: 2nd sheet as a `DataFrame`
    * ``"Sheet1"``: Load sheet with name "Sheet1"
    * ``[0, 1, "Sheet5"]``: Load first, second and sheet named "Sheet5"
      as a dict of `DataFrame`
    * None: All worksheets.

header : int, list of int, default 0
    Row (0-indexed) to use for the column labels of the parsed
    DataFrame. If a list of integers is passed those row positions will
    be combined into a ``MultiIndex``. Use None if there is no header.
names : array-like, default None
    List of column names to use. If file contains no header row,
    then you should explicitly pass header=None.
index_col : int, str, list of int, default None
    Column (0-indexed) to use as the row labels of the DataFrame.
    Pass None if there is no such column.  If a list is passed,
    those columns will be combined into a ``MultiIndex``.  If a
    subset of data is selected with ``usecols``, index_col
    is based on the subset.

    Missing values will be forward filled to allow roundtripping with
    ``to_excel`` for ``merged_cells=True``. To avoid forward filling the
    missing values use ``set_index`` after reading the data instead of
    ``index_col``.
usecols : str, list-like, or callable, default None
    * If None, then parse all columns.
    * If str, then indicates comma separated list of Excel column letters
      and column ranges (e.g. "A:E" or "A,C,E:F"). Ranges are inclusive of
      both sides.
    * If list of int, then indicates list of column numbers to be parsed
      (0-indexed).
    * If list of string, then indicates list of column names to be parsed.
    * If callable, then evaluate each column name against it and parse the
      column if the callable returns ``True``.

    Returns a subset of the columns according to behavior above.
dtype : Type name or dict of column -> type, default None
    Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32}
    Use `object` to preserve data as stored in Excel and not interpret dtype.
    If converters are specified, they will be applied INSTEAD
    of dtype conversion.
engine : str, default None
    If io is not a buffer or path, this must be set to identify io.
    Supported engines: "xlrd", "openpyxl", "odf", "pyxlsb".
    Engine compatibility :

    - "xlrd" supports old-style Excel files (.xls).
    - "openpyxl" supports newer Excel file formats.
    - "odf" supports OpenDocument file formats (.odf, .ods, .odt).
    - "pyxlsb" supports Binary Excel files.

    .. versionchanged:: 1.2.0
        The engine `xlrd <https://xlrd.readthedocs.io/en/latest/>`_
        now only supports old-style ``.xls`` files.
        When ``engine=None``, the following logic will be
        used to determine the engine:

       - If ``path_or_buffer`` is an OpenDocument format (.odf, .ods, .odt),
         then `odf <https://pypi.org/project/odfpy/>`_ will be used.
       - Otherwise if ``path_or_buffer`` is an xls format,
         ``xlrd`` will be used.
       - Otherwise if ``path_or_buffer`` is in xlsb format,
         ``pyxlsb`` will be used.

         .. versionadded:: 1.3.0
       - Otherwise ``openpyxl`` will be used.

         .. versionchanged:: 1.3.0

converters : dict, default None
    Dict of functions for converting values in certain columns. Keys can
    either be integers or column labels, values are functions that take one
    input argument, the Excel cell content, and return the transformed
    content.
true_values : list, default None
    Values to consider as True.
false_values : list, default None
    Values to consider as False.
skiprows : list-like, int, or callable, optional
    Line numbers to skip (0-indexed) or number of lines to skip (int) at the
    start of the file. If callable, the callable function will be evaluated
    against the row indices, returning True if the row should be skipped and
    False otherwise. An example of a valid callable argument would be ``lambda
    x: x in [0, 2]``.
nrows : int, default None
    Number of rows to parse.
na_values : scalar, str, list-like, or dict, default None
    Additional strings to recognize as NA/NaN. If dict passed, specific
    per-column NA values. By default the following values are interpreted
    as NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
    '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'None',
    'n/a', 'nan', 'null'.
keep_default_na : bool, default True
    Whether or not to include the default NaN values when parsing the data.
    Depending on whether `na_values` is passed in, the behavior is as follows:

    * If `keep_default_na` is True, and `na_values` are specified, `na_values`
      is appended to the default NaN values used for parsing.
    * If `keep_default_na` is True, and `na_values` are not specified, only
      the default NaN values are used for parsing.
    * If `keep_default_na` is False, and `na_values` are specified, only
      the NaN values specified `na_values` are used for parsing.
    * If `keep_default_na` is False, and `na_values` are not specified, no
      strings will be parsed as NaN.

    Note that if `na_filter` is passed in as False, the `keep_default_na` and
    `na_values` parameters will be ignored.
na_filter : bool, default True
    Detect missing value markers (empty strings and the value of na_values). In
    data without any NAs, passing na_filter=False can improve the performance
    of reading a large file.
verbose : bool, default False
    Indicate number of NA values placed in non-numeric columns.
parse_dates : bool, list-like, or dict, default False
    The behavior is as follows:

    * bool. If True -> try parsing the index.
    * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
      each as a separate date column.
    * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
      a single date column.
    * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
      result 'foo'

    If a column or index contains an unparsable date, the entire column or
    index will be returned unaltered as an object data type. If you don`t want to
    parse some cells as date just change their type in Excel to "Text".
    For non-standard datetime parsing, use ``pd.to_datetime`` after ``pd.read_excel``.

    Note: A fast-path exists for iso8601-formatted dates.
date_parser : function, optional
    Function to use for converting a sequence of string columns to an array of
    datetime instances. The default uses ``dateutil.parser.parser`` to do the
    conversion. Pandas will try to call `date_parser` in three different ways,
    advancing to the next if an exception occurs: 1) Pass one or more arrays
    (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
    string values from the columns defined by `parse_dates` into a single array
    and pass that; and 3) call `date_parser` once for each row using one or
    more strings (corresponding to the columns defined by `parse_dates`) as
    arguments.

    .. deprecated:: 2.0.0
       Use ``date_format`` instead, or read in as ``object`` and then apply
       :func:`to_datetime` as-needed.
date_format : str or dict of column -> format, default ``None``
   If used in conjunction with ``parse_dates``, will parse dates according to this
   format. For anything more complex,
   please read in as ``object`` and then apply :func:`to_datetime` as-needed.

   .. versionadded:: 2.0.0
thousands : str, default None
    Thousands separator for parsing string columns to numeric.  Note that
    this parameter is only necessary for columns stored as TEXT in Excel,
    any numeric columns will automatically be parsed, regardless of display
    format.
decimal : str, default '.'
    Character to recognize as decimal point for parsing string columns to numeric.
    Note that this parameter is only necessary for columns stored as TEXT in Excel,
    any numeric columns will automatically be parsed, regardless of display
    format.(e.g. use ',' for European data).

    .. versionadded:: 1.4.0

comment : str, default None
    Comments out remainder of line. Pass a character or characters to this
    argument to indicate comments in the input file. Any data between the
    comment string and the end of the current line is ignored.
skipfooter : int, default 0
    Rows at the end to skip (0-indexed).
storage_options : dict, optional
    Extra options that make sense for a particular storage connection, e.g.
    host, port, username, password, etc. For HTTP(S) URLs the key-value pairs
    are forwarded to ``urllib.request.Request`` as header options. For other
    URLs (e.g. starting with "s3://", and "gcs://") the key-value pairs are
    forwarded to ``fsspec.open``. Please see ``fsspec`` and ``urllib`` for more
    details, and for more examples on storage options refer `here
    <https://pandas.pydata.org/docs/user_guide/io.html?
    highlight=storage_options#reading-writing-remote-files>`_.

    .. versionadded:: 1.2.0

dtype_backend : {'numpy_nullable', 'pyarrow'}, default 'numpy_nullable'
    Back-end data type applied to the resultant :class:`DataFrame`
    (still experimental). Behaviour is as follows:

    * ``"numpy_nullable"``: returns nullable-dtype-backed :class:`DataFrame`
      (default).
    * ``"pyarrow"``: returns pyarrow-backed nullable :class:`ArrowDtype`
      DataFrame.

    .. versionadded:: 2.0

engine_kwargs : dict, optional
    Arbitrary keyword arguments passed to excel engine.

Returns
-------
DataFrame or dict of DataFrames
    DataFrame from the passed in Excel file. See notes in sheet_name
    argument for more information on when a dict of DataFrames is returned.

See Also
--------
DataFrame.to_excel : Write DataFrame to an Excel file.
DataFrame.to_csv : Write DataFrame to a comma-separated values (csv) file.
read_csv : Read a comma-separated values (csv) file into DataFrame.
read_fwf : Read a table of fixed-width formatted lines into DataFrame.

Notes
-----
For specific information on the methods used for each Excel engine, refer to the pandas
:ref:`user guide <io.excel_reader>`

Examples
--------
The file can be read using the file name as string or an open file object:

>>> pd.read_excel('tmp.xlsx', index_col=0)  # doctest: +SKIP
       Name  Value
0   string1      1
1   string2      2
2  #Comment      3

>>> pd.read_excel(open('tmp.xlsx', 'rb'),
...               sheet_name='Sheet3')  # doctest: +SKIP
   Unnamed: 0      Name  Value
0           0   string1      1
1           1   string2      2
2           2  #Comment      3

Index and header can be specified via the `index_col` and `header` arguments

>>> pd.read_excel('tmp.xlsx', index_col=None, header=None)  # doctest: +SKIP
     0         1      2
0  NaN      Name  Value
1  0.0   string1      1
2  1.0   string2      2
3  2.0  #Comment      3

Column types are inferred but can be explicitly specified

>>> pd.read_excel('tmp.xlsx', index_col=0,
...               dtype={'Name': str, 'Value': float})  # doctest: +SKIP
       Name  Value
0   string1    1.0
1   string2    2.0
2  #Comment    3.0

True, False, and NA values, and thousands separators have defaults,
but can be explicitly specified, too. Supply the values you would like
as strings or lists of strings!

>>> pd.read_excel('tmp.xlsx', index_col=0,
...               na_values=['string1', 'string2'])  # doctest: +SKIP
       Name  Value
0       NaN      1
1       NaN      2
2  #Comment      3

Comment lines in the excel input file can be skipped using the `comment` kwarg

>>> pd.read_excel('tmp.xlsx', index_col=0, comment='#')  # doctest: +SKIP
      Name  Value
0  string1    1.0
1  string2    2.0
2     None    NaN
File:      ~/opt/anaconda3/envs/DMML2023/lib/python3.11/site-packages/pandas/io/excel/_base.py
Type:      function

In [68]:
composers_df = pd.read_excel('dataset/composers.xlsx', index_col = 'composer')
composers_df

              birth  death              city
composer
Mahler         1860   1911           Kaliste
Beethoven      1770   1827              Bonn
Puccini        1858   1924           Lucques
Shostakovich   1906   1975  Saint-Petersburg

If we open the file in Excel, we see that it is composed of more than one sheet. Clearly, when not specifying anything, the reader only reads the first sheet. However we can specify a sheet:

In [69]:
composers_df = pd.read_excel('dataset/composers.xlsx', index_col = 'composer', sheet_name='Sheet2')
composers_df

                birth    death              city
composer
Mahler           1860     1911           Kaliste
Beethoven        1770     1827              Bonn
Puccini          1858     1924           Lucques
Shostakovich     1906     1975  Saint-Petersburg
Sibelius      unknown  unknown           unknown
Haydn             NaN      NaN            Rohrau

In [70]:
composers_df.describe()

        birth  death     city
count       5      5        6
unique      5      5        6
top      1860   1911  Kaliste
freq        1      1        1

As you can see above, some information is missing. Some missing values are marked as "`unknown`" while other are `NaN`. `NaN` is the standard symbol for unknown/missing values and is understood by Pandas while "`unknown`" is just seen as text. 
This is impractical as now we have columns with a mix of numbers and text which will make later computations difficult. What we would like to do is to replace all "irrelevant" values with the standard `NaN` symbol that says "*no information*".
For this we can use the `na_values` argument to specify what should be a `NaN`:

In [71]:
composers_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Mahler to Haydn
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   birth   5 non-null      object
 1   death   5 non-null      object
 2   city    6 non-null      object
dtypes: object(3)
memory usage: 192.0+ bytes

In [72]:
composers_df = pd.read_excel('dataset/composers.xlsx', index_col = 'composer', sheet_name='Sheet2', 
                             na_values=['unknown'])
composers_df

               birth   death              city
composer
Mahler        1860.0  1911.0           Kaliste
Beethoven     1770.0  1827.0              Bonn
Puccini       1858.0  1924.0           Lucques
Shostakovich  1906.0  1975.0  Saint-Petersburg
Sibelius         NaN     NaN               NaN
Haydn            NaN     NaN            Rohrau

In [73]:
composers_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Mahler to Haydn
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   birth   4 non-null      float64
 1   death   4 non-null      float64
 2   city    5 non-null      object
dtypes: float64(2), object(1)
memory usage: 192.0+ bytes

### Read / Write SQL database

from the [docs](https://pandas.pydata.org/docs/reference/api/pandas.read_sql.html)

Read data from SQL via either a SQL query or a SQL tablename. 
Note that when using a SQLite database only SQL queries are accepted, providing only the SQL tablename will result in an error.

In [74]:
from sqlite3 import connect
conn = connect(':memory:') # most common way to force an SQLite database to exist purely in memory 
df = pd.DataFrame(data=[[0, '10/11/12'], [1, '12/11/10']],
                  columns=['int_column', 'date_column'])
df.to_sql('test_data', conn) # Returns number of rows affected by to_sql, or None if the callable passed into method does not return an integer number of rows.

2

In [75]:
df

   int_column date_column
0           0    10/11/12
1           1    12/11/10

In [76]:
pd.read_sql('SELECT int_column, date_column FROM test_data', conn)

   int_column date_column
0           0    10/11/12
1           1    12/11/10

## Missing data
pandas primarily uses the value `np.nan` to represent missing data. It is by default not included in computations.

In [77]:
df_new = composers_df.copy()

In [78]:
df_new

               birth   death              city
composer
Mahler        1860.0  1911.0           Kaliste
Beethoven     1770.0  1827.0              Bonn
Puccini       1858.0  1924.0           Lucques
Shostakovich  1906.0  1975.0  Saint-Petersburg
Sibelius         NaN     NaN               NaN
Haydn            NaN     NaN            Rohrau

Get a boolean mask where values are `np.nan` (as for Series).

In [79]:
pd.isna(df_new)

              birth  death   city
composer
Mahler        False  False  False
Beethoven     False  False  False
Puccini       False  False  False
Shostakovich  False  False  False
Sibelius       True   True   True
Haydn          True   True  False

In [80]:
df_new.isna().values.any()

True

In [81]:
df_new.isna().sum()

birth    2
death    2
city     1
dtype: int64

To drop missing data.

In [82]:
df_new.dropna(how = 'any') # delete any row and column with at least one np.nan

               birth   death              city
composer
Mahler        1860.0  1911.0           Kaliste
Beethoven     1770.0  1827.0              Bonn
Puccini       1858.0  1924.0           Lucques
Shostakovich  1906.0  1975.0  Saint-Petersburg

In [83]:
df_new.dropna(how = 'all') # the whole row (or column) must be np.nan

               birth   death              city
composer
Mahler        1860.0  1911.0           Kaliste
Beethoven     1770.0  1827.0              Bonn
Puccini       1858.0  1924.0           Lucques
Shostakovich  1906.0  1975.0  Saint-Petersburg
Haydn            NaN     NaN            Rohrau

Filling missing data

In [84]:
df_new.fillna(value=5)

               birth   death              city
composer
Mahler        1860.0  1911.0           Kaliste
Beethoven     1770.0  1827.0              Bonn
Puccini       1858.0  1924.0           Lucques
Shostakovich  1906.0  1975.0  Saint-Petersburg
Sibelius         5.0     5.0                 5
Haydn            5.0     5.0            Rohrau

# DataFrame Operations

One of the great advantages of using Pandas to handle tabular data is how simple it is to extract valuable information from them. Here we are going to see various types of operations that are available for this.


## Matrix operations

The strength of Numpy is its natural way of handling matrix operations, and Pandas reuses a lot of these features. For example one can use simple mathematical operations to opereate at the cell level:

In [85]:
df = pd.read_excel('dataset/composers.xlsx')
df

       composer  birth  death              city
0        Mahler   1860   1911           Kaliste
1     Beethoven   1770   1827              Bonn
2       Puccini   1858   1924           Lucques
3  Shostakovich   1906   1975  Saint-Petersburg

In [86]:
df['birth'] * 2

0    3720
1    3540
2    3716
3    3812
Name: birth, dtype: int64

In [87]:
np.log(df['birth'])

0    7.528332
1    7.478735
2    7.527256
3    7.552762
Name: birth, dtype: float64

We can directly use an operation's output to create a new column:

In [88]:
df['age'] = df['death'] - df['birth']
df

       composer  birth  death              city  age
0        Mahler   1860   1911           Kaliste   51
1     Beethoven   1770   1827              Bonn   57
2       Puccini   1858   1924           Lucques   66
3  Shostakovich   1906   1975  Saint-Petersburg   69

Here we applied functions only to series. Indeed, since our Dataframe contains e.g. strings, no operation can be done on it. If however we have a homogenous Dataframe, this is possible:

In [89]:
df[['birth', 'death']] * 2

   birth  death
0   3720   3822
1   3540   3654
2   3716   3848
3   3812   3950

## Column operations

There are other types of functions whose purpose is to summarize the data. For example the mean or standard deviation. Pandas by default applies such functions column-wise and returns a series containing e.g. the mean of each column:

In [90]:
df[['birth','death','age']].mean()

birth    1848.50
death    1909.25
age        60.75
dtype: float64

Sometimes one needs to apply to a column a very specific function that is not provided by default. In that case we can use one of the different `apply` methods of Pandas.

The simplest case is to apply a function to a column, or Series of a DataFrame. Let's say for example that we want to define the age >60 as 'old' and <60 as 'young'. We can define the following general function:

In [91]:
define_age = lambda x: 'old' if x > 60 else 'young'

We can now apply this function on an entire Series:

In [92]:
df['categorical age'] = df.age.apply(define_age)

In [93]:
df

       composer  birth  death              city  age categorical age
0        Mahler   1860   1911           Kaliste   51           young
1     Beethoven   1770   1827              Bonn   57           young
2       Puccini   1858   1924           Lucques   66             old
3  Shostakovich   1906   1975  Saint-Petersburg   69             old

In [94]:
df['compact categorical age'] = df.age.apply(lambda x: 'old' if x > 60 else 'young') # as before, but more compact
df

,composer,birth,death,city,age,categorical age,compact categorical age
0,Mahler,1860,1911,Kaliste,51,young,young
1,Beethoven,1770,1827,Bonn,57,young,young
2,Puccini,1858,1924,Lucques,66,old,old
3,Shostakovich,1906,1975,Saint-Petersburg,69,old,old

### Value Counting

In [95]:
df['categorical age'].value_counts()

categorical age
young    2
old      2
Name: count, dtype: int64

In [96]:
df['categorical age'].unique()

array(['young', 'old'], dtype=object)

# Data Splitting

Often Pandas tables mix regular variables (e.g. the size of cells in microscopy images) with categorical variables (e.g. the type of cell to which they belong). In that case, it is quite usual to split the data using the category to do computations. Pandas allows to do this very easily.

## Grouping

In [97]:
composers_df = pd.read_excel('dataset/composers.xlsx', index_col = 'composer', sheet_name='Sheet5')

In [98]:
composers_df

              birth   death         period  country
composer
Mahler         1860  1911.0  post-romantic  Austria
Beethoven      1770  1827.0       romantic  Germany
Puccini        1858  1924.0  post-romantic    Italy
Shostakovich   1906  1975.0         modern   Russia
Verdi          1813  1901.0       romantic    Italy
Dvorak         1841  1904.0       romantic  Czechia
Schumann       1810  1856.0       romantic  Germany
Stravinsky     1882  1971.0         modern   Russia
Sibelius       1865  1957.0  post-romantic  Finland
Haydn          1732  1809.0        classic  Austria
Mozart         1756  1791.0        classic  Austria
Messiaen       1908  1992.0         modern   France
Prokofiev      1891  1953.0         modern   RUssia
Monteverdi     1567  1643.0    renaissance    Italy
Haendel        1685  1759.0        baroque  Germany
Brahms         1833  1897.0       romantic  Germany
Purcell        1659  1695.0        baroque  England
Charpentier    1643  1704.0        baroque   France
Bruckner       1824  1896.0  post-romantic  Austria
Berg           1885  1935.0         modern  Austria
Couperin       1626  1661.0        baroque   France
Rameau         1683  1764.0        baroque   France
Berlioz        1803  1869.0       romantic   France
Gounod         1818  1893.0       romantic   France
Massenet       1842  1912.0       romantic   France
Boulez         1925  2016.0         modern   France
Palestrina     1525  1594.0    renaissance    Italy
Gesualdo       1566  1613.0    renaissance    Italy
Caldara        1670  1736.0        baroque    Italy
Pergolesi      1710  1736.0        baroque    Italy
Scarlatti      1685  1757.0        baroque    Italy
Caccini        1587  1640.0        baroque    Italy
Cimarosa       1749  1801.0        classic    Italy
Donizetti      1797  1848.0       romantic    Italy
Leoncavallo    1858  1919.0       romantic    Italy
Bellini        1801  1835.0       romantic    Italy
Dufay          1397  1474.0    renaissance  Belgium
Lassus         1532  1594.0    renaissance  Belgium
Borodin        1833  1887.0       romantic   Russia
Mussorsgsky    1839  1881.0       romantic   Russia
Soler          1754  1806.0        classic    Spain
Albeniz        1860  1909.0       romantic    Spain
Granados       1867  1916.0       romantic    Spain
Dowland        1563  1626.0    renaissance  England
Byrd           1540  1623.0    renaissance  England
Walton         1902  1983.0         modern  England
Adès           1971     NaN         modern  England
Bach           1685  1750.0        baroque  Germany
Wagner         1813  1883.0       romantic  Germany
Strauss        1864  1949.0  post-romantic  Germany
Orff           1895  1982.0         modern  Germany
Dusek          1731  1799.0        classic  Czechia
Smetana        1824  1884.0       romantic  Czechia
Janacek        1854  1928.0         modern  Czechia
Copland        1900  1990.0         modern      USA
Bernstein      1918  1990.0         modern      USA
Glass          1937     NaN         modern      USA

In [99]:
composers_df.head()

              birth   death         period  country
composer
Mahler         1860  1911.0  post-romantic  Austria
Beethoven      1770  1827.0       romantic  Germany
Puccini        1858  1924.0  post-romantic    Italy
Shostakovich   1906  1975.0         modern   Russia
Verdi          1813  1901.0       romantic    Italy

What if we want now to count how many composers we have in each category? 

Pandas simplifies this with the `groupby()` function, which actually groups elements by a certain criteria, e.g. a categorical variable like the period:

In [100]:
composer_grouped = composers_df.groupby('period')
composer_grouped

The output is a bit cryptic. What we actually have is a new object called *group* which has a lot of handy properties. First let's see what the groups actually are. As for the Dataframe, let's look at a summary of the object:

In [101]:
composer_grouped.describe()

              birth                                                          \
              count         mean        std     min     25%     50%     75%
period
baroque        10.0  1663.300000  36.009412  1587.0  1647.0  1676.5  1685.0
classic         5.0  1744.400000  12.054045  1731.0  1732.0  1749.0  1754.0
modern         13.0  1905.692308  28.595992  1854.0  1891.0  1902.0  1918.0
post-romantic   5.0  1854.200000  17.123084  1824.0  1858.0  1860.0  1864.0
renaissance     7.0  1527.142857  59.881629  1397.0  1528.5  1540.0  1564.5
romantic       17.0  1824.823529  25.468695  1770.0  1810.0  1824.0  1841.0

                      death                                                   \
                  max count         mean        std     min      25%     50%
period
baroque        1710.0  10.0  1720.200000  43.460838  1640.0  1697.25  1736.0
classic        1756.0   5.0  1801.200000   6.942622  1791.0  1799.00  1801.0
modern         1971.0  11.0  1974.090909  26.139834  1928.0  1962.00  1982.0
post-romantic  1865.0   5.0  1927.400000  25.540164  1896.0  1911.00  1924.0
renaissance    1567.0   7.0  1595.285714  56.295986  1474.0  1594.00  1613.0
romantic       1867.0  17.0  1883.588235  28.026904  1827.0  1869.00  1887.0


                   75%     max
period
baroque        1755.25  1764.0
classic        1806.00  1809.0
modern         1990.00  2016.0
post-romantic  1949.00  1957.0
renaissance    1624.50  1643.0
romantic       1904.00  1919.0

So we have a dataframe with a statistical summary of the the contents. The "names" of the groups are here the indices of the Dataframe. These names are simply all the different categories that were present in the column we used for grouping. Now we can recover a single group:

In [102]:
composer_grouped.get_group('baroque')

             birth   death   period  country
composer
Haendel       1685  1759.0  baroque  Germany
Purcell       1659  1695.0  baroque  England
Charpentier   1643  1704.0  baroque   France
Couperin      1626  1661.0  baroque   France
Rameau        1683  1764.0  baroque   France
Caldara       1670  1736.0  baroque    Italy
Pergolesi     1710  1736.0  baroque    Italy
Scarlatti     1685  1757.0  baroque    Italy
Caccini       1587  1640.0  baroque    Italy
Bach          1685  1750.0  baroque  Germany

If one has multiple categorical variables, one can also do a grouping on several levels. For example here we want to classify composers both by period and country. For this we just give two column names to the `groupby()` function:

In [103]:
composer_grouped = composers_df.groupby(['period','country'])
composer_grouped.get_group(('baroque','Germany'))

          birth   death   period  country
composer
Haendel    1685  1759.0  baroque  Germany
Bach       1685  1750.0  baroque  Germany

In [104]:
for k,v in composer_grouped:
    print(k)
    display(v)

('baroque', 'England')

          birth   death   period  country
composer
Purcell    1659  1695.0  baroque  England

('baroque', 'France')

             birth   death   period country
composer
Charpentier   1643  1704.0  baroque  France
Couperin      1626  1661.0  baroque  France
Rameau        1683  1764.0  baroque  France

('baroque', 'Germany')

          birth   death   period  country
composer
Haendel    1685  1759.0  baroque  Germany
Bach       1685  1750.0  baroque  Germany

('baroque', 'Italy')

           birth   death   period country
composer
Caldara     1670  1736.0  baroque   Italy
Pergolesi   1710  1736.0  baroque   Italy
Scarlatti   1685  1757.0  baroque   Italy
Caccini     1587  1640.0  baroque   Italy

('classic', 'Austria')

          birth   death   period  country
composer
Haydn      1732  1809.0  classic  Austria
Mozart     1756  1791.0  classic  Austria

('classic', 'Czechia')

          birth   death   period  country
composer
Dusek      1731  1799.0  classic  Czechia

('classic', 'Italy')

          birth   death   period country
composer
Cimarosa   1749  1801.0  classic   Italy

('classic', 'Spain')

          birth   death   period country
composer
Soler      1754  1806.0  classic   Spain

('modern', 'Austria')

          birth   death  period  country
composer
Berg       1885  1935.0  modern  Austria

('modern', 'Czechia')

          birth   death  period  country
composer
Janacek    1854  1928.0  modern  Czechia

('modern', 'England')

          birth   death  period  country
composer
Walton     1902  1983.0  modern  England
Adès       1971     NaN  modern  England

('modern', 'France')

          birth   death  period country
composer
Messiaen   1908  1992.0  modern  France
Boulez     1925  2016.0  modern  France

('modern', 'Germany')

          birth   death  period  country
composer
Orff       1895  1982.0  modern  Germany

('modern', 'RUssia')

           birth   death  period country
composer
Prokofiev   1891  1953.0  modern  RUssia

('modern', 'Russia')

              birth   death  period country
composer
Shostakovich   1906  1975.0  modern  Russia
Stravinsky     1882  1971.0  modern  Russia

('modern', 'USA')

           birth   death  period country
composer
Copland     1900  1990.0  modern     USA
Bernstein   1918  1990.0  modern     USA
Glass       1937     NaN  modern     USA

('post-romantic', 'Austria')

          birth   death         period  country
composer
Mahler     1860  1911.0  post-romantic  Austria
Bruckner   1824  1896.0  post-romantic  Austria

('post-romantic', 'Finland')

          birth   death         period  country
composer
Sibelius   1865  1957.0  post-romantic  Finland

('post-romantic', 'Germany')

          birth   death         period  country
composer
Strauss    1864  1949.0  post-romantic  Germany

('post-romantic', 'Italy')

          birth   death         period country
composer
Puccini    1858  1924.0  post-romantic   Italy

('renaissance', 'Belgium')

          birth   death       period  country
composer
Dufay      1397  1474.0  renaissance  Belgium
Lassus     1532  1594.0  renaissance  Belgium

('renaissance', 'England')

          birth   death       period  country
composer
Dowland    1563  1626.0  renaissance  England
Byrd       1540  1623.0  renaissance  England

('renaissance', 'Italy')

            birth   death       period country
composer
Monteverdi   1567  1643.0  renaissance   Italy
Palestrina   1525  1594.0  renaissance   Italy
Gesualdo     1566  1613.0  renaissance   Italy

('romantic', 'Czechia')

          birth   death    period  country
composer
Dvorak     1841  1904.0  romantic  Czechia
Smetana    1824  1884.0  romantic  Czechia

('romantic', 'France')

          birth   death    period country
composer
Berlioz    1803  1869.0  romantic  France
Gounod     1818  1893.0  romantic  France
Massenet   1842  1912.0  romantic  France

('romantic', 'Germany')

           birth   death    period  country
composer
Beethoven   1770  1827.0  romantic  Germany
Schumann    1810  1856.0  romantic  Germany
Brahms      1833  1897.0  romantic  Germany
Wagner      1813  1883.0  romantic  Germany

('romantic', 'Italy')

             birth   death    period country
composer
Verdi         1813  1901.0  romantic   Italy
Donizetti     1797  1848.0  romantic   Italy
Leoncavallo   1858  1919.0  romantic   Italy
Bellini       1801  1835.0  romantic   Italy

('romantic', 'Russia')

             birth   death    period country
composer
Borodin       1833  1887.0  romantic  Russia
Mussorsgsky   1839  1881.0  romantic  Russia

('romantic', 'Spain')

          birth   death    period country
composer
Albeniz    1860  1909.0  romantic   Spain
Granados   1867  1916.0  romantic   Spain

The main advantage of this Group object is that it allows us to do very quickly both computations and plotting without having to loop through different categories. Indeed Pandas makes all the work for us: it applies functions on each group and then reassembles the results into a Dataframe (or Series depending on output).
For example we can apply most functions we used for Dataframes (mean, sum etc.) on groups as well and Pandas seamlessly does the work for us.

### Grouping on index

In [105]:
df1 = pd.DataFrame({'a':[1,2,3], 'b':[4,5,6]})
df1

   a  b
0  1  4
1  2  5
2  3  6

In [106]:
df2 = pd.DataFrame({'a':[1,5], 'b':[8,0]})
df2

   a  b
0  1  8
1  5  0

In [107]:
df_concat = pd.concat([df1,df2])
df_concat

   a  b
0  1  4
1  2  5
2  3  6
0  1  8
1  5  0

In [108]:
dir(df_concat)

['T',
 '_AXIS_LEN',
 '_AXIS_ORDERS',
 '_AXIS_TO_AXIS_NUMBER',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_ufunc__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__dataframe__',
 '__dataframe_consortium_standard__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pandas_priority__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_accum_func',
 '_agg_examples_doc',
 '_agg_see_also_doc',
 '_align_for_op',
 '_align_frame',
 '_align_series',
 '_append',
 '_arith_method',
 '_arith_method_with_reindex',
 '_as_manager',
 '_attrs',
 '_box_col_values',
 '_can_fast_transpose',
 '_check_inplace_and_allows_duplicate_labels',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_cmp_method',
 '_combine_frame',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_result',
 '_constructor',
 '_constructor_from_mgr',
 '_constructor_sliced',
 '_constructor_sliced_from_mgr',
 '_create_data_for_split_and_tight_to_dict',
 '_data',
 '_deprecate_downcast',
 '_dir_additions',
 '_dir_deletions',
 '_dispatch_frame_op',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_ensure_valid_index',
 '_find_valid_index',
 '_flags',
 '_flex_arith_method',
 '_flex_cmp_method',
 '_from_arrays',
 '_from_mgr',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cleaned_column_resolvers',
 '_get_column_array',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_getitem_bool_array',
 '_getitem_multilevel',
 '_getitem_nocopy',
 '_getitem_slice',
 '_gotitem',
 '_hidden_attrs',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_mgr',
 '_inplace_method',
 '_internal_names',
 '_internal_names_set',
 '_is_copy',
 '_is_homogeneous_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_view',
 '_iset_item',
 '_iset_item_mgr',
 '_iset_not_inplace',
 '_item_cache',
 '_iter_column_arrays',
 '_ixs',
 '_logical_func',
 '_logical_method',
 '_maybe_align_series_as_frame',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_mgr',
 '_min_count_stat_function',
 '_needs_reindex_multi',
 '_pad_or_backfill',
 '_protect_consolidate',
 '_reduce',
 '_reduce_axis1',
 '_reindex_axes',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_rename',
 '_replace_columnwise',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_series',
 '_set_axis',
 '_set_axis_name',
 '_set_axis_nocheck',
 '_set_is_copy',
 '_set_item',
 '_set_item_frame_value',
 '_set_item_mgr',
 '_set_value',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_shift_with_freq',
 '_should_reindex_frame_op',
 '_slice',
 '_sliced_from_mgr',
 '_stat_function',
 '_stat_function_ddof',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_to_latex_via_styler',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'a',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'apply',
 'applymap',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'attrs',
 'axes',
 'b',
 'backfill',
 'between_time',
 'bfill',
 'bool',
 'boxplot',
 'clip',
 'columns',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'flags',
 'floordiv',
 'from_dict',
 'from_records',
 'ge',
 'get',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'isetitem',
 'isin',
 'isna',
 'isnull',
 'items',
 'iterrows',
 'itertuples',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_flags',
 'set_index',
 'shape',
 'shift',
 'size',
 'skew',
 'sort_index',
 'sort_values',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_markdown',
 'to_numpy',
 'to_orc',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'to_xml',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'where',
 'xs']

In [109]:
by_row_index = df_concat.groupby(df_concat.index)
for index_value, group in by_row_index:
    display(group)

   a  b
0  1  4
0  1  8

   a  b
1  2  5
1  5  0

   a  b
2  3  6

In [110]:
df_avg = by_row_index.mean()
df_avg

     a    b
0  1.0  6.0
1  3.5  2.5
2  3.0  6.0